--------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/eyayawteka/Documents/exercise-1.log
  log type:  text
 opened on:   7 May 2020, 11:21:40

. 
. // let's look at the data (structure)
. desc 

Contains data from https://www.stata.com/data/jwooldridge/eacsap/nls
> 80.dta
  obs:           935                          
 vars:            17                          2 Sep 1996 16:00
 size:        20,570                          
--------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
--------------------------------------------------------------------
wage            int     %9.0g                 monthly earnings
hours           byte    %9.0g                 average weekly hours
iq              int     %9.0g                 IQ score
kww             byte    %9.0g                 knowledge of world
                                                work score
educ            byte    %9.0g                 years of education
exper           byte    %9.0g                 years of work
                                                experience
tenure          byte    %9.0g                 years with current
                                                employer
age             byte    %9.0g                 age in years
married         byte    %9.0g                 =1 if married
black           byte    %9.0g                 =1 if black
south           byte    %9.0g                 =1 if live in south
urban           byte    %9.0g                 =1 if live in SMSA
sibs            byte    %9.0g                 number of siblings
brthord         byte    %9.0g                 birth order
meduc           byte    %9.0g                 mother's education
feduc           byte    %9.0g                 father's education
lwage           float   %9.0g                 log(wage)
--------------------------------------------------------------------
Sorted by: 

. // let's get some summaries/stats
. 
. summ 

    Variable |        Obs        Mean    Std. Dev.       Min        
> Max
-------------+------------------------------------------------------
> ---
        wage |        935    957.9455    404.3608        115       3
> 078
       hours |        935    43.92941    7.224256         20        
>  80
          iq |        935    101.2824    15.05264         50        
> 145
         kww |        935    35.74439    7.638788         12        
>  56
        educ |        935    13.46845    2.196654          9        
>  18
-------------+------------------------------------------------------
> ---
       exper |        935    11.56364    4.374586          1        
>  23
      tenure |        935    7.234225    5.075206          0        
>  22
         age |        935    33.08021    3.107803         28        
>  38
     married |        935    .8930481    .3092174          0        
>   1
       black |        935    .1283422    .3346495          0        
>   1
-------------+------------------------------------------------------
> ---
       south |        935    .3411765    .4743582          0        
>   1
       urban |        935    .7176471    .4503851          0        
>   1
        sibs |        935    2.941176    2.306254          0        
>  14
     brthord |        852    2.276995    1.595613          1        
>  10
       meduc |        857    10.68261    2.849756          0        
>  18
-------------+------------------------------------------------------
> ---
       feduc |        741    10.21727      3.3007          0        
>  18
       lwage |        935    6.779004    .4211439   4.744932   8.032
> 035

. 
. 
. 
. // b) ========================================================
. 
. egen avewage = mean(wage)

. egen medwage = median(wage) // or pctile(wage), p(50) for median

. 
. list avewage medwage in 1/1

     +---------------------+
     |   avewage   medwage |
     |---------------------|
  1. | 957.94545       905 |
     +---------------------+

. 
. 
. hist wage, freq kdensity // wage distribution 
(bin=29, start=115, width=102.17241)

. hist wage, by(married)

. 
. egen avewage_married = mean(wage) if married
(100 missing values generated)

. list avewage_married in 1/1

     +----------+
     | avewag~d |
     |----------|
  1. | 977.0479 |
     +----------+

. 
. // c) ===========================================================
. // let's create some dummies from the existing variables
. 
. // we need to call `summ iq` and then Stata saves the result in th
> e memory in ...
. // an object called `r` and we can access 
. // the `median` `r(p50)`; or create a new var which captures this 
> constant.
. 
. // -------------------------------------------------------
. // way 1:
. summ iq, detail            //return list 

                          IQ score
-------------------------------------------------------------
      Percentiles      Smallest
 1%           64             50
 5%           74             54
10%           82             55       Obs                 935
25%           92             59       Sum of Wgt.         935

50%          102                      Mean           101.2824
                        Largest       Std. Dev.      15.05264
75%          112            134
90%          120            134       Variance       226.5819
95%          125            137       Skewness      -.3404246
99%          132            145       Kurtosis       2.977035

. 
. local median_iq = r(p50)

. display `median_iq'
102

. 
. // we can create the dummy: gen high_iq = 1 if iq > r(p50)
. //-------------------------------------------------------
. 
. // ----------------------
. // // way 2:
. // egen median_iq = median(iq)
. gen high_iq = 1 if iq > `median_iq'
(473 missing values generated)

. replace high_iq = 0 if high_iq == . // replace missing from the pr
> evious expression 
(473 real changes made)

. // --------------------------
. 
. 
. // educ dummies
. gen educ_dummy :medium = 1 if educ == 13
(850 missing values generated)

. replace educ_dummy = 0  if educ < 13
(481 real changes made)

. replace educ_dummy = 2 if educ > 13
(369 real changes made)

. 
. label variable educ_dummy "educ level"

. label define educ_dummy 0 "low" 1 "medium" 2 "high" 

. label value educ_dummy educ_dummy 

. 
. tabulate educ_dummy, gen(educ_) // creates 3 educ dummies low, med
> ium, and high

 educ level |      Freq.     Percent        Cum.
------------+-----------------------------------
        low |        481       51.44       51.44
     medium |         85        9.09       60.53
       high |        369       39.47      100.00
------------+-----------------------------------
      Total |        935      100.00

. list educ* in 1/10 // to see the 10 rows of the new vars

     +--------------------------------------------+
     | educ   educ_d~y   educ_1   educ_2   educ_3 |
     |--------------------------------------------|
  1. |   12        low        1        0        0 |
  2. |   18       high        0        0        1 |
  3. |   14       high        0        0        1 |
  4. |   12        low        1        0        0 |
  5. |   11        low        1        0        0 |
     |--------------------------------------------|
  6. |   16       high        0        0        1 |
  7. |   10        low        1        0        0 |
  8. |   18       high        0        0        1 |
  9. |   15       high        0        0        1 |
 10. |   12        low        1        0        0 |
     +--------------------------------------------+

. 
. rename (educ_1 educ_2 educ_3) (low_educ  medium_educ high_educ)

. 
. // d) ========================================================
. 
. 
. //model 1
.  
. reg wage married high_iq low_educ medium_educ high_educ exper tenu
> re age feduc
note: low_educ omitted because of collinearity

      Source |       SS           df       MS      Number of obs   =
>        741
-------------+----------------------------------   F(8, 732)       =
>      19.93
       Model |    21804524         8   2725565.5   Prob > F        =
>     0.0000
    Residual |   100111818       732  136764.779   R-squared       =
>     0.1788
-------------+----------------------------------   Adj R-squared   =
>     0.1699
       Total |   121916342       740  164751.814   Root MSE        =
>     369.82

--------------------------------------------------------------------
> ----------
        wage |      Coef.   Std. Err.      t    P>|t|     [95% Conf.
>  Interval]
-------------+------------------------------------------------------
> ----------
     married |   159.7013   43.24595     3.69   0.000     74.80038  
>   244.6021
     high_iq |   96.84444   31.02786     3.12   0.002     35.93023  
>   157.7586
    low_educ |          0  (omitted)
 medium_educ |   106.3401   52.66409     2.02   0.044     2.949464  
>   209.7308
   high_educ |   196.4145   37.47494     5.24   0.000     122.8434  
>   269.9857
       exper |   9.706229   4.253185     2.28   0.023     1.356335  
>   18.05612
      tenure |    4.40135   2.862136     1.54   0.125    -1.217624  
>   10.02032
         age |   15.22755   5.286087     2.88   0.004     4.849847  
>   25.60524
       feduc |   18.36467   4.569597     4.02   0.000     9.393596  
>   27.33575
       _cons |  -139.0357   161.1908    -0.86   0.389    -455.4871  
>   177.4158
--------------------------------------------------------------------
> ----------

. // model 2
. reg wage married high_iq medium_educ exper tenure age feduc

      Source |       SS           df       MS      Number of obs   =
>        741
-------------+----------------------------------   F(7, 733)       =
>      18.19
       Model |    18047538         7  2578219.71   Prob > F        =
>     0.0000
    Residual |   103868804       733  141703.689   R-squared       =
>     0.1480
-------------+----------------------------------   Adj R-squared   =
>     0.1399
       Total |   121916342       740  164751.814   Root MSE        =
>     376.44

--------------------------------------------------------------------
> ----------
        wage |      Coef.   Std. Err.      t    P>|t|     [95% Conf.
>  Interval]
-------------+------------------------------------------------------
> ----------
     married |   157.5126   44.01783     3.58   0.000     71.09659  
>   243.9287
     high_iq |   156.0342   29.41691     5.30   0.000     98.28276  
>   213.7856
 medium_educ |   5.452849   49.89757     0.11   0.913    -92.50635  
>    103.412
       exper |   .6819872   3.958693     0.17   0.863    -7.089741  
>   8.453715
      tenure |   3.819779   2.911167     1.31   0.190    -1.895441  
>   9.534998
         age |   21.48988   5.241435     4.10   0.000     11.19987  
>   31.77989
       feduc |   24.83448   4.478448     5.55   0.000     16.04236  
>   33.62659
       _cons |  -241.3199   162.8686    -1.48   0.139    -561.0644  
>   78.42454
--------------------------------------------------------------------
> ----------

. 
. 
. 
. 
. // e) ===========================================================
. 
. // model 3
. // we would have created an int term between married and high_ig a
> s:
. // `gen married_high_iq = married * high_iq`
. 
. reg wage married high_iq c.married#c.high_iq medium_educ exper ten
> ure age feduc

      Source |       SS           df       MS      Number of obs   =
>        741
-------------+----------------------------------   F(8, 732)       =
>      15.97
       Model |  18117920.3         8  2264740.04   Prob > F        =
>     0.0000
    Residual |   103798422       732  141801.123   R-squared       =
>     0.1486
-------------+----------------------------------   Adj R-squared   =
>     0.1393
       Total |   121916342       740  164751.814   Root MSE        =
>     376.56

--------------------------------------------------------------------
> ----------
        wage |      Coef.   Std. Err.      t    P>|t|     [95% Conf.
>  Interval]
-------------+------------------------------------------------------
> ----------
     married |   127.1966   61.56753     2.07   0.039     6.326591  
>   248.0666
     high_iq |   101.4075   82.93396     1.22   0.222    -61.40926  
>   264.2243
             |
   c.married#|
   c.high_iq |   61.54249   87.35406     0.70   0.481    -109.9519  
>   233.0368
             |
 medium_educ |    6.20019     49.926     0.12   0.901    -91.81503  
>   104.2154
       exper |   .6479797   3.960348     0.16   0.870    -7.127015  
>   8.422974
      tenure |    3.86348   2.912828     1.33   0.185    -1.855013  
>   9.581974
         age |   21.55802   5.244128     4.11   0.000     11.26269  
>   31.85334
       feduc |   24.83258   4.479989     5.54   0.000     16.03742  
>   33.62774
       _cons |  -216.8104   166.5974    -1.30   0.194    -543.8761  
>   110.2553
--------------------------------------------------------------------
> ----------

. 
. 
. // f) ===========================================================
. 
. // model 4 --- log-level
. 
. reg lwage married educ exper tenure age feduc 

      Source |       SS           df       MS      Number of obs   =
>        741
-------------+----------------------------------   F(6, 734)       =
>      28.59
       Model |  24.4476397         6  4.07460662   Prob > F        =
>     0.0000
    Residual |  104.602519       734  .142510243   R-squared       =
>     0.1894
-------------+----------------------------------   Adj R-squared   =
>     0.1828
       Total |  129.050158       740  .174392106   Root MSE        =
>     .37751

--------------------------------------------------------------------
> ----------
       lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf.
>  Interval]
-------------+------------------------------------------------------
> ----------
     married |   .1831965   .0441194     4.15   0.000     .0965812  
>   .2698118
        educ |   .0601809   .0078237     7.69   0.000     .0448215  
>   .0755404
       exper |   .0142866   .0044388     3.22   0.001     .0055723  
>   .0230009
      tenure |   .0087432   .0029094     3.01   0.003     .0030313  
>    .014455
         age |   .0101801   .0054937     1.85   0.064    -.0006051  
>   .0209654
       feduc |   .0174151   .0046718     3.73   0.000     .0082433  
>   .0265869
       _cons |   5.078223   .1731425    29.33   0.000     4.738309  
>   5.418136
--------------------------------------------------------------------
> ----------

. 
. // g) ======================================================
. // model 5 --- log-log
. 
. gen leduc = ln(educ)

. 
. reg lwage married  leduc exper tenure age feduc 

      Source |       SS           df       MS      Number of obs   =
>        741
-------------+----------------------------------   F(6, 734)       =
>      29.05
       Model |  24.7634088         6  4.12723481   Prob > F        =
>     0.0000
    Residual |  104.286749       734   .14208004   R-squared       =
>     0.1919
-------------+----------------------------------   Adj R-squared   =
>     0.1853
       Total |  129.050158       740  .174392106   Root MSE        =
>     .37694

--------------------------------------------------------------------
> ----------
       lwage |      Coef.   Std. Err.      t    P>|t|     [95% Conf.
>  Interval]
-------------+------------------------------------------------------
> ----------
     married |   .1829344    .044052     4.15   0.000     .0964515  
>   .2694173
       leduc |   .8502992   .1083639     7.85   0.000      .637559  
>   1.063039
       exper |    .014666   .0044368     3.31   0.001     .0059557  
>   .0233763
      tenure |   .0087679   .0029048     3.02   0.003     .0030651  
>   .0144707
         age |    .010597   .0054608     1.94   0.053    -.0001236  
>   .0213176
       feduc |   .0171091   .0046678     3.67   0.000     .0079452  
>    .026273
       _cons |   3.673696   .2870312    12.80   0.000     3.110196  
>   4.237196
--------------------------------------------------------------------
> ----------

. 
. // h) ==================================================
. // model 6 --- level-log 
. 
. reg wage married leduc exper tenure age feduc 

      Source |       SS           df       MS      Number of obs   =
>        741
-------------+----------------------------------   F(6, 734)       =
>      26.92
       Model |    21990223         6  3665037.16   Prob > F        =
>     0.0000
    Residual |  99926119.3       734  136139.127   R-squared       =
>     0.1804
-------------+----------------------------------   Adj R-squared   =
>     0.1737
       Total |   121916342       740  164751.814   Root MSE        =
>     368.97

--------------------------------------------------------------------
> ----------
        wage |      Coef.   Std. Err.      t    P>|t|     [95% Conf.
>  Interval]
-------------+------------------------------------------------------
> ----------
     married |   170.8208   43.12113     3.96   0.000     86.16533  
>   255.4762
       leduc |   809.5461   106.0742     7.63   0.000     601.3011  
>   1017.791
       exper |   12.65578   4.343029     2.91   0.004     4.129545  
>   21.18203
      tenure |   4.207879   2.843465     1.48   0.139    -1.374415  
>   9.790172
         age |   11.90558   5.345375     2.23   0.026     1.411538  
>   22.39963
       feduc |   17.89887   4.569207     3.92   0.000     8.928602  
>   26.86915
       _cons |  -2028.218   280.9661    -7.22   0.000    -2579.811  
>  -1476.625
--------------------------------------------------------------------
> ----------

. 
. log close 
      name:  <unnamed>
       log:  /Users/eyayawteka/Documents/exercise-1.log
  log type:  text
 closed on:   7 May 2020, 11:21:41
--------------------------------------------------------------------
